In [1]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [35]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns = list('ABCD'))
df

                   A         B         C         D
2013-01-01 -0.210385 -0.218473  0.695526 -0.341274
2013-01-02  1.304908  0.127968 -0.250007  0.063344
2013-01-03 -1.072292  1.392411 -0.082650  0.922720
2013-01-04  0.575298  2.549795  1.629366 -0.473192
2013-01-05 -0.148929 -0.729263  0.755684  0.999011
2013-01-06  0.685095  0.280209  0.486861  0.054729

In [8]:
df2 = pd.DataFrame({'A':1., 
                   'B': pd.Timestamp('20130102'),
                   'C': pd.Series(1,index=list(range(4)),dtype='float32'),
                   'D': np.array([3]*4, dtype='int32'),
                    'E': pd.Categorical(['test', 'train', 'test', 'train']),
                    'F': 'foo'
                   })
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [9]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [10]:
df.head()

                   A         B         C         D
2013-01-01 -0.459923 -0.534666  0.836642 -0.789141
2013-01-02 -0.277021  0.002727 -0.585925  0.697991
2013-01-03  0.023414  0.059669  0.249079 -0.354766
2013-01-04 -0.765300 -0.178927 -0.092721 -0.390724
2013-01-05 -1.381422 -1.637093 -1.795064  0.369205

In [11]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.765300 -0.178927 -0.092721 -0.390724
2013-01-05 -1.381422 -1.637093 -1.795064  0.369205
2013-01-06  0.394311  1.346687  0.562451 -0.582426

In [12]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [13]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [14]:
df.to_numpy()

array([[-0.45992328, -0.53466592,  0.83664167, -0.78914123],
       [-0.27702053,  0.00272719, -0.58592497,  0.69799114],
       [ 0.02341352,  0.05966876,  0.24907944, -0.35476555],
       [-0.76529972, -0.17892676, -0.09272111, -0.39072449],
       [-1.38142153, -1.63709296, -1.79506387,  0.36920521],
       [ 0.39431135,  1.34668678,  0.56245063, -0.58242623]])

In [15]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.459923   -0.277021    0.023414   -0.765300   -1.381422    0.394311
B   -0.534666    0.002727    0.059669   -0.178927   -1.637093    1.346687
C    0.836642   -0.585925    0.249079   -0.092721   -1.795064    0.562451
D   -0.789141    0.697991   -0.354766   -0.390724    0.369205   -0.582426

In [16]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.789141  0.836642 -0.534666 -0.459923
2013-01-02  0.697991 -0.585925  0.002727 -0.277021
2013-01-03 -0.354766  0.249079  0.059669  0.023414
2013-01-04 -0.390724 -0.092721 -0.178927 -0.765300
2013-01-05  0.369205 -1.795064 -1.637093 -1.381422
2013-01-06 -0.582426  0.562451  1.346687  0.394311

In [17]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-05 -1.381422 -1.637093 -1.795064  0.369205
2013-01-01 -0.459923 -0.534666  0.836642 -0.789141
2013-01-04 -0.765300 -0.178927 -0.092721 -0.390724
2013-01-02 -0.277021  0.002727 -0.585925  0.697991
2013-01-03  0.023414  0.059669  0.249079 -0.354766
2013-01-06  0.394311  1.346687  0.562451 -0.582426

In [18]:
### Pandas Filtering

In [19]:
df['A']

2013-01-01   -0.459923
2013-01-02   -0.277021
2013-01-03    0.023414
2013-01-04   -0.765300
2013-01-05   -1.381422
2013-01-06    0.394311
Freq: D, Name: A, dtype: float64

In [20]:
df.A

2013-01-01   -0.459923
2013-01-02   -0.277021
2013-01-03    0.023414
2013-01-04   -0.765300
2013-01-05   -1.381422
2013-01-06    0.394311
Freq: D, Name: A, dtype: float64

In [21]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.459923 -0.534666  0.836642 -0.789141
2013-01-02 -0.277021  0.002727 -0.585925  0.697991
2013-01-03  0.023414  0.059669  0.249079 -0.354766

In [22]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -0.277021  0.002727 -0.585925  0.697991
2013-01-03  0.023414  0.059669  0.249079 -0.354766
2013-01-04 -0.765300 -0.178927 -0.092721 -0.390724

In [23]:
df.loc['2013-01-01']

A   -0.459923
B   -0.534666
C    0.836642
D   -0.789141
Name: 2013-01-01 00:00:00, dtype: float64

In [24]:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -0.459923 -0.534666
2013-01-02 -0.277021  0.002727
2013-01-03  0.023414  0.059669
2013-01-04 -0.765300 -0.178927
2013-01-05 -1.381422 -1.637093
2013-01-06  0.394311  1.346687

In [25]:
df.loc['20130101':'20130103',['A','B']]

                   A         B
2013-01-01 -0.459923 -0.534666
2013-01-02 -0.277021  0.002727
2013-01-03  0.023414  0.059669

In [27]:
df.loc[dates[0],'A']

-0.4599232833915393

In [28]:
df.iloc[3]

A   -0.765300
B   -0.178927
C   -0.092721
D   -0.390724
Name: 2013-01-04 00:00:00, dtype: float64

In [29]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -0.765300 -0.178927
2013-01-05 -1.381422 -1.637093

In [30]:
df.iloc[1:3]

                   A         B         C         D
2013-01-02 -0.277021  0.002727 -0.585925  0.697991
2013-01-03  0.023414  0.059669  0.249079 -0.354766

In [32]:
df = pd.DataFrame({'string': list('abc'),
                       'int64': list(range(1, 4)),
                       'uint8': np.arange(3, 6).astype('u1'),
                       'float64': np.arange(4.0, 7.0),
                       'bool1': [True, False, True],
                       'bool2': [False, True, False],
                       'dates': pd.date_range('now', periods=3),
                       'category': pd.Series(list("ABC")).astype('category')})
df

,string,int64,uint8,float64,bool1,bool2,dates,category
0,a,1,3,4.0,True,False,2020-07-28 13:10:49.640340,A
1,b,2,4,5.0,False,True,2020-07-29 13:10:49.640340,B
2,c,3,5,6.0,True,False,2020-07-30 13:10:49.640340,C

In [33]:
df.select_dtypes(include=[bool])

   bool1  bool2
0   True  False
1  False   True
2   True  False

In [39]:
df[df['A']>0]

                   A         B         C         D
2013-01-02  1.304908  0.127968 -0.250007  0.063344
2013-01-04  0.575298  2.549795  1.629366 -0.473192
2013-01-06  0.685095  0.280209  0.486861  0.054729

In [41]:
df2 = df.copy()
df2['E']=['one','one','two','three','four','three']
df2

                   A         B         C         D      E
2013-01-01 -0.210385 -0.218473  0.695526 -0.341274    one
2013-01-02  1.304908  0.127968 -0.250007  0.063344    one
2013-01-03 -1.072292  1.392411 -0.082650  0.922720    two
2013-01-04  0.575298  2.549795  1.629366 -0.473192  three
2013-01-05 -0.148929 -0.729263  0.755684  0.999011   four
2013-01-06  0.685095  0.280209  0.486861  0.054729  three

In [43]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03 -1.072292  1.392411 -0.082650  0.922720   two
2013-01-05 -0.148929 -0.729263  0.755684  0.999011  four

In [44]:
df.iat[0,1] = 0
df

                   A         B         C         D
2013-01-01 -0.210385  0.000000  0.695526 -0.341274
2013-01-02  1.304908  0.127968 -0.250007  0.063344
2013-01-03 -1.072292  1.392411 -0.082650  0.922720
2013-01-04  0.575298  2.549795  1.629366 -0.473192
2013-01-05 -0.148929 -0.729263  0.755684  0.999011
2013-01-06  0.685095  0.280209  0.486861  0.054729

In [46]:
df.iloc[0,1]=2
df

                   A         B         C         D
2013-01-01 -0.210385  2.000000  0.695526 -0.341274
2013-01-02  1.304908  0.127968 -0.250007  0.063344
2013-01-03 -1.072292  1.392411 -0.082650  0.922720
2013-01-04  0.575298  2.549795  1.629366 -0.473192
2013-01-05 -0.148929 -0.729263  0.755684  0.999011
2013-01-06  0.685095  0.280209  0.486861  0.054729

In [48]:
df.at[dates[0],'A']=0
df

                   A         B         C         D
2013-01-01  0.000000  2.000000  0.695526 -0.341274
2013-01-02  1.304908  0.127968 -0.250007  0.063344
2013-01-03 -1.072292  1.392411 -0.082650  0.922720
2013-01-04  0.575298  2.549795  1.629366 -0.473192
2013-01-05 -0.148929 -0.729263  0.755684  0.999011
2013-01-06  0.685095  0.280209  0.486861  0.054729

In [50]:
df.loc[dates[0],'A']=2
df

                   A         B         C         D
2013-01-01  2.000000  2.000000  0.695526 -0.341274
2013-01-02  1.304908  0.127968 -0.250007  0.063344
2013-01-03 -1.072292  1.392411 -0.082650  0.922720
2013-01-04  0.575298  2.549795  1.629366 -0.473192
2013-01-05 -0.148929 -0.729263  0.755684  0.999011
2013-01-06  0.685095  0.280209  0.486861  0.054729

In [52]:
df.loc[:,'D']=np.array([5]*len(df))
df

                   A         B         C  D
2013-01-01  2.000000  2.000000  0.695526  5
2013-01-02  1.304908  0.127968 -0.250007  5
2013-01-03 -1.072292  1.392411 -0.082650  5
2013-01-04  0.575298  2.549795  1.629366  5
2013-01-05 -0.148929 -0.729263  0.755684  5
2013-01-06  0.685095  0.280209  0.486861  5

In [54]:
df = pd.DataFrame({'A': ['one', 'one', 'two', 'three'] * 3,
                       'B': ['A', 'B', 'C'] * 4,
                       'C': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                       'D': np.random.randn(12),
                       'E': np.random.randn(12)})
df

        A  B    C         D         E
0     one  A  foo -1.436887  0.331309
1     one  B  foo -1.315121  0.394136
2     two  C  foo  0.340216 -0.683724
3   three  A  bar  0.884185  0.793312
4     one  B  bar -0.852411  1.924237
5     one  C  bar  0.430657 -0.776857
6     two  A  foo -0.050297  1.441808
7   three  B  foo  0.106134 -0.272863
8     one  C  foo -0.561798 -0.100784
9     one  A  bar  2.555526  1.460744
10    two  B  bar -0.488910  0.373591
11  three  C  bar -0.547040 -0.452560

In [55]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A  2.555526 -1.436887
      B -0.852411 -1.315121
      C  0.430657 -0.561798
three A  0.884185       NaN
      B       NaN  0.106134
      C -0.547040       NaN
two   A       NaN -0.050297
      B -0.488910       NaN
      C       NaN  0.340216

In [57]:
df.index

RangeIndex(start=0, stop=12, step=1)